_posts/2017-04-10-Simple-SVN-Server-On-Gentoo.html
---
layout : post
title : Simple SVN Server On Gentoo
categories : Utils
tags : svn
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9e2d712">安装</a></li>
<li><a href="#org34b217b">配置</a></li>
<li><a href="#org745f38d">启动服务</a>
<ul>
<li><a href="#orgddaf700">openrc</a></li>
<li><a href="#org1487fef">systemd</a></li>
</ul>
</li>
<li><a href="#org594c9e1">Check out files &amp; play</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9e2d712" class="outline-2">
<h2 id="org9e2d712">安装</h2>
<div class="outline-text-2" id="text-org9e2d712">
<div class="org-src-container">
<pre class="src src-console">emerge -av subversion
</pre>
</div>
</div>
</div>

<div id="outline-container-org34b217b" class="outline-2">
<h2 id="org34b217b">配置</h2>
<div class="outline-text-2" id="text-org34b217b">
<div class="org-src-container">
<pre class="src src-console">emerge --config dev-vcs/subversion
</pre>
</div>

<p>
之后进入 /var/svn/repos/conf 目录，编辑文件 <code>svnserver.conf</code> :
</p>

<div class="org-src-container">
<pre class="src src-conf">[<span style="color: #32cd32;">general</span>]
<span style="color: #daa520;">anon-access</span> = none   <span style="color: #cd5c5c; font-style: italic;">#</span><span style="color: #cd5c5c; font-style: italic;">&#65288;&#21311;&#21517;&#29992;&#25143;&#19981;&#21487;&#36827;&#65289;</span>
<span style="color: #daa520;">auth-access</span> = write  <span style="color: #cd5c5c; font-style: italic;">#</span><span style="color: #cd5c5c; font-style: italic;">&#65288;&#35748;&#35777;&#29992;&#25143;&#21487;&#20197;&#35835;&#20889;&#65289;</span>
<span style="color: #daa520;">password-db</span> = passwd <span style="color: #cd5c5c; font-style: italic;">#</span><span style="color: #cd5c5c; font-style: italic;">&#65288;&#29992;&#25143;&#20449;&#24687;&#25351;&#23450;&#22312;&#24403;&#21069;&#30446;&#24405;&#30340;passwd&#25991;&#20214;&#65289;</span>
</pre>
</div>


<p>
然后到当前目录下编辑一下passwd文件，形如：
</p>
<div class="org-src-container">
<pre class="src src-conf">[<span style="color: #32cd32;">users</span>]
<span style="color: #daa520;">yyc</span> = 000000
</pre>
</div>
</div>
</div>

<div id="outline-container-org745f38d" class="outline-2">
<h2 id="org745f38d">启动服务</h2>
<div class="outline-text-2" id="text-org745f38d">
</div>
<div id="outline-container-orgddaf700" class="outline-3">
<h3 id="orgddaf700">openrc</h3>
<div class="outline-text-3" id="text-orgddaf700">
<p>
如果使用 openrc，可以直接执行： /etc/init.d/svnserve start
</p>
</div>
</div>

<div id="outline-container-org1487fef" class="outline-3">
<h3 id="org1487fef">systemd</h3>
<div class="outline-text-3" id="text-org1487fef">
<p>
subversion 没有提供 systemd 的 unit，需要自己写一个。如果像我一样只是临时测试用，可以直接用命令行启动 svnserve：
</p>

<div class="org-src-container">
<pre class="src src-console"><span style="color: #32cd32;">t-station ~ #</span> svnserve -d -r /var/svn/ --pid-file /var/run/svnd.pid
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org594c9e1" class="outline-2">
<h2 id="org594c9e1">Check out files &amp; play</h2>
<div class="outline-text-2" id="text-org594c9e1">
<div class="org-src-container">
<pre class="src src-console">svn co svn://localhost/repos --username yyc
</pre>
</div>
</div>
</div>
